app/controllers/postings_controller.rb

SELECT "postings".* FROM "postings"
---
  def index
    @postings = Posting.all

INSERT INTO "postings" ("name", "neighborhood", "crime_type", "short_desc", "cross_street", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @posting = Posting.new(posting_params)

    if @posting.save

UPDATE "postings" SET "cross_street" = $1, "updated_at" = $2 WHERE "postings"."id" = $3  [["cross_street", "Weeeeee"], ["updated_at", "2020-12-12 05:49:04.123059"], ["id", 5]]
---
  def update
    if @posting.update(posting_params)

DELETE FROM "postings" WHERE "postings"."id" = $1  [["id", 6]]
---
  def destroy
    @posting.destroy

SELECT "postings".* FROM "postings" WHERE "postings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_posting
      @posting = Posting.find(params[:id])